![Alt text]()

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> Pandas is an open-source data manipulation and analysis library for the Python programming language. It provides data structures and functions for working with structured data, such as tabular data, time series, and more. Pandas is a popular choice for data scientists, analysts, and researchers when it comes to data cleaning, transformation, and analysis.</div>

In [1]:
import pandas as pd
import numpy as np

# <span style='color:#150458 '> Use Cases : </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> 
    
1. Reading CSV/excel/JSON file
    
2. EDA
    
3. Data Cleaning
    
4. Encoding(OneHot Encoder)
    
5. Join Tables (left , right, inner, outer)
    
6. Feature Selection
</div>

# <span style='color:#150458 '> Data Structures : </span>

## 1 <span style='color:#E70488 '> | </span> Series

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> A one-dimensional labeled array capable of holding any data type (integers, strings, floating-point numbers, Python objects, etc.). It is similar to a one-dimensional NumPy array, but it has an index, which makes it more flexible. </div>

In [2]:
series = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
series2 = pd.Series(['a','b','c','d','e'])
series2

0    a
1    b
2    c
3    d
4    e
dtype: object

## 2 <span style='color:#E70488 '> | </span> DataFrame

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

* A two-dimensional labeled data structure with columns of potentially different data types. It is similar to a spreadsheet or SQL table, where each column can have a different type.

    
* Two Data Structures:
    1. DataFrame (2-D >> rows and column)
    2. Series(1-D array) >> Single column of dataframe</div>

In [4]:
data = {'Name':['Alka','Madhu','Kiara'],
       'Age':[34,54,23],
       'City':['NY','Mumbai','Delhi']}

df = pd.DataFrame(data)
df

    Name  Age    City
0   Alka   34      NY
1  Madhu   54  Mumbai
2  Kiara   23   Delhi

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> In addition to these main data structures, Pandas also provides other specialized data structures like Index, TimeSeries, and Categorical. Here's a brief overview: </div>

###  <span style='color:#E70488 '> [ </span> Index<span style='color:#E70488 '> ] </span>

In [5]:
index = pd.Index(['a','b','c','d'])
index

Index(['a', 'b', 'c', 'd'], dtype='object')

###  <span style='color:#E70488 '> [ </span> TimeSeries <span style='color:#E70488 '> ] </span>

In [6]:
dates = pd.date_range('2020-01-01', periods=5)
ts = pd.Series([1,2,3,4,5],index=dates)
dates

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05'],
              dtype='datetime64[ns]', freq='D')

###  <span style='color:#E70488 '> [ </span> Categorical <span style='color:#E70488 '> ] </span>

In [7]:
cat = pd.Categorical(['a','b','c'])
cat

['a', 'b', 'c']
Categories (3, object): ['a', 'b', 'c']

# <span style='color:#150458 '> Functions : </span>

###  <span style='color:#E70488 '> [ </span> Read DataFrame <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1. Read CSV File : </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

1. index_col
    
2. header
    
3. usecols
    
4. delimiter</div>

In [8]:
df_heart = pd.read_csv('dataset/heart.csv')
df_heart

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [9]:
df_heart = pd.read_csv('dataset/heart.csv',index_col='age')
df_heart

,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
age,,,,,,,,,,,,,
63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [10]:
df_heart = pd.read_csv('dataset/heart.csv',header=None)
df_heart

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
1,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
2,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
3,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
4,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
299,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
300,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
301,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
302,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
303,57,0,1,130,236,0,0,174,0,0,1,1,2,0

In [11]:
df_heart = pd.read_csv('dataset/heart.csv',usecols=['age','sex','target'])
df_heart

     age  sex  target
0     63    1       1
1     37    1       1
2     41    0       1
3     56    1       1
4     57    0       1
..   ...  ...     ...
298   57    0       0
299   45    1       0
300   68    1       0
301   57    1       0
302   57    0       0

[303 rows x 3 columns]

In [12]:
df = pd.read_csv('dataset/movies_data.csv',delimiter='|')
df

    star_rating,title,content_rating,genre,duration,actors_list
0    9.3,The Shawshank Redemption,R,Crime,142,"[u'T...
1    9.2,The Godfather,R,Crime,175,"[u'Marlon Brand...
2    9.1,The Godfather: Part II,R,Crime,200,"[u'Al ...
3    9,The Dark Knight,PG-13,Action,152,"[u'Christi...
4    8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta...
..                                                 ...
974  7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman',...
975  7.4,Back to the Future Part III,PG,Adventure,1...
976  7.4,Master and Commander: The Far Side of the ...
977  7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Willi...
978  7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen'...

[979 rows x 1 columns]

####  <span style='color:#E70488 '> 2. Read Excel File : </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

1. index_col
    
2. header
    
3. usecols
    
</div>

In [14]:
df_emp = pd.read_excel('dataset/Emp_Records.xlsx')
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [16]:
df2 = pd.read_excel('dataset/Emp_Records.xlsx', sheet_name = 'emp_salary')
df2

    Salary          City
0   168251        Denver
1    51063     Stonewall
2    50155  Michigantown
3   180294      Hydetown
4   117642       Fremont
..     ...           ...
95  129774        Biloxi
96  156194  Carol Stream
97   95673       Detroit
98   51015      Mc Grath
99   93650          Alma

[100 rows x 2 columns]

###  <span style='color:#E70488 '> [ </span> Create DataFrame <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1. Create CSV File : </span>

In [18]:
df = pd.DataFrame(np.random.randint(10,30,size=(10,6)),columns=list('python'))
df

    p   y   t   h   o   n
0  28  20  14  19  25  18
1  19  26  27  23  24  18
2  26  14  24  11  27  17
3  12  25  16  26  28  19
4  24  14  21  29  29  10
5  23  26  19  17  17  13
6  15  27  15  23  27  20
7  16  16  21  22  18  13
8  16  14  21  27  28  13
9  27  14  24  13  23  28

In [19]:
df.to_csv('dataset/data.csv')

In [20]:
df = pd.DataFrame(np.random.randint(10,30,[6,7]))
df.to_csv('data.csv',header=False,index=False)

####  <span style='color:#E70488 '> 2. Create Excel File : </span>

In [21]:
df.to_excel('data.xlsx', index=False, header=False, sheet_name='data')

In [22]:
writer = pd.ExcelWriter('data1.xlsx', engine='xlsxwriter')
df.to_excel(writer,index=False, sheet_name='movie')
writer.save()

####  <span style='color:#E70488 '> 3. Create Dictionary : </span>

In [23]:
df.to_dict(orient='list')

{0: [28, 18, 27, 26, 28, 17],
 1: [18, 23, 19, 28, 28, 19],
 2: [22, 19, 20, 13, 20, 15],
 3: [16, 14, 23, 20, 12, 18],
 4: [22, 10, 21, 22, 14, 24],
 5: [29, 29, 27, 23, 13, 16],
 6: [27, 10, 24, 27, 26, 21]}

In [24]:
df.to_dict(orient='records')

[{0: 28, 1: 18, 2: 22, 3: 16, 4: 22, 5: 29, 6: 27},
 {0: 18, 1: 23, 2: 19, 3: 14, 4: 10, 5: 29, 6: 10},
 {0: 27, 1: 19, 2: 20, 3: 23, 4: 21, 5: 27, 6: 24},
 {0: 26, 1: 28, 2: 13, 3: 20, 4: 22, 5: 23, 6: 27},
 {0: 28, 1: 28, 2: 20, 3: 12, 4: 14, 5: 13, 6: 26},
 {0: 17, 1: 19, 2: 15, 3: 18, 4: 24, 5: 16, 6: 21}]

####  <span style='color:#E70488 '> 4. Create JSON File : </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

df.to_json('filename.json',orient='list'/'records')
    
</div>

In [25]:
df.to_json('file.json')

###  <span style='color:#E70488 '> [ </span> Shape of Dataframe <span style='color:#E70488 '> ] </span>

In [26]:
df_emp.shape

(100, 7)

In [27]:
print("Number of rows :", df_emp.shape[0])
print("Number of columns :", df_emp.shape[1])

Number of rows : 100
Number of columns : 7

###  <span style='color:#E70488 '> [ </span> Columns <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> To get column names from dataframe </div>

In [28]:
df_emp.columns

Index(['Emp ID', 'First Name', 'Age in Yrs', 'Weight in Kgs', 'Age in Company',
       'Salary', 'City'],
      dtype='object')

###  <span style='color:#E70488 '> [ </span> Index <span style='color:#E70488 '> ] </span>

In [29]:
df_emp.index

RangeIndex(start=0, stop=100, step=1)

###  <span style='color:#E70488 '> [ </span> Axes <span style='color:#E70488 '> ] </span>

In [30]:
df_emp.axes

[RangeIndex(start=0, stop=100, step=1),
 Index(['Emp ID', 'First Name', 'Age in Yrs', 'Weight in Kgs', 'Age in Company',
        'Salary', 'City'],
       dtype='object')]

###  <span style='color:#E70488 '> [ </span> dtypes <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;"> To get datatypes of coulmns  </div>

In [31]:
df_emp.dtypes

Emp ID              int64
First Name         object
Age in Yrs        float64
Weight in Kgs       int64
Age in Company    float64
Salary              int64
City               object
dtype: object

###  <span style='color:#E70488 '> [ </span> info <span style='color:#E70488 '> ] </span>

In [32]:
df_emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Emp ID          100 non-null    int64
 1   First Name      100 non-null    object
 2   Age in Yrs      100 non-null    float64
 3   Weight in Kgs   100 non-null    int64
 4   Age in Company  100 non-null    float64
 5   Salary          100 non-null    int64
 6   City            100 non-null    object
dtypes: float64(2), int64(3), object(2)
memory usage: 5.6+ KB

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6 non-null      int32
 1   1       6 non-null      int32
 2   2       6 non-null      int32
 3   3       6 non-null      int32
 4   4       6 non-null      int32
 5   5       6 non-null      int32
 6   6       6 non-null      int32
dtypes: int32(7)
memory usage: 296.0 bytes

###  <span style='color:#E70488 '> [ </span> describe <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To get statistical summary  </div>

In [34]:
df_emp.describe()

             Emp ID  Age in Yrs  Weight in Kgs  Age in Company         Salary
count     100.00000  100.000000     100.000000      100.000000     100.000000
mean   547652.10000   39.238700      58.080000        8.978400  119738.090000
std    257664.16679   12.066252      12.294106        8.657358   46185.278194
min    134841.00000   21.100000      40.000000        0.020000   42005.000000
25%    328643.75000   28.177500      50.000000        2.152500   83979.750000
50%    497414.00000   37.595000      56.000000        6.435000  118049.500000
75%    766040.00000   49.900000      61.250000       13.762500  162509.250000
max    979607.00000   59.470000      90.000000       34.520000  197537.000000

In [36]:
df = pd.read_csv('dataset/titanic.csv')

In [37]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.386083,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.487123,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [38]:
df.describe(include='all')

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.386083,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.487123,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

###  <span style='color:#E70488 '> [ </span> duplicates <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To find if dataset has any duplicate values  </div>

In [39]:
df_emp.duplicated()

0     False
1     False
2     False
3     False
4     False
      ...
95    False
96    False
97    False
98    False
99    False
Length: 100, dtype: bool

In [40]:
df.duplicated().sum()

0

###  <span style='color:#E70488 '> [ </span> value_counts() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To get a count of categorical observations  </div>

In [41]:
df_emp['City'].value_counts()

Denver          1
Maxwell         1
Eckert          1
Haswell         1
Kansas City     1
               ..
Panacea         1
Mesa            1
Lawrenceburg    1
Mount Vernon    1
Alma            1
Name: City, Length: 100, dtype: int64

In [42]:
df['Gender'].value_counts()

male      577
female    314
Name: Gender, dtype: int64

###  <span style='color:#E70488 '> [ </span> unique() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To get unique categorical observations  </div>

In [43]:
df['Gender'].unique()

array(['male', 'female'], dtype=object)

In [44]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

###  <span style='color:#E70488 '> [ </span> nunique() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To get count of unique observations  </div>

In [45]:
df['Gender'].nunique()

2

###  <span style='color:#E70488 '> [ </span> series to dict <span style='color:#E70488 '> ] </span>

In [46]:
df['Gender'].value_counts().to_dict()

{'male': 577, 'female': 314}

###  <span style='color:#E70488 '> [ </span> replace() <span style='color:#E70488 '> ] </span>

In [47]:
df['Gender'].replace({'male': 0, 'female': 1})

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Gender, Length: 891, dtype: int64

In [48]:
df['Gender'].replace({'male': 0, 'female': 1},inplace=True)

###  <span style='color:#E70488 '> [ </span> astype <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">To change datatype of column  </div>

In [49]:
df['PassengerId'].astype('float')

0        1.0
1        2.0
2        3.0
3        4.0
4        5.0
       ...
886    887.0
887    888.0
888    889.0
889    890.0
890    891.0
Name: PassengerId, Length: 891, dtype: float64

In [50]:
df['Pclass'] = df['Pclass'].astype('float')

###  <span style='color:#E70488 '> [ </span> insert() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

* Inserting column in dataframe
    
* df.insert(index_number , Column_Name, Value, allow_duplicates=)  </div>

In [51]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3.0,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C

In [52]:
df.insert(1,'ID',10)

In [53]:
df.head(2)

,PassengerId,ID,Survived,Pclass,Name,Gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,10,0,3.0,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,10,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C

###  <span style='color:#E70488 '> [ </span> rename() <span style='color:#E70488 '> ] </span>

In [54]:
df.rename({'Gender':'Sex'},axis=1)

,PassengerId,ID,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,10,0,3.0,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,10,1,1.0,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,10,1,3.0,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,10,1,1.0,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,S
4,5,10,0,3.0,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,10,0,2.0,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,NaN,S
887,888,10,1,1.0,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,S
888,889,10,0,3.0,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,10,1,1.0,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,C
890,891,10,0,3.0,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,NaN,Q

###  <span style='color:#E70488 '> [ </span> apply() <span style='color:#E70488 '> ] </span>

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">

* Applying any function on Dataframe or column
    
* df.apply(function)  </div>

In [55]:
df1 = pd.DataFrame(np.random.randint(1,10,[5,5]),columns=list('abcde'))
df1

   a  b  c  d  e
0  2  4  5  8  1
1  8  1  9  8  1
2  2  3  6  5  4
3  2  6  3  7  3
4  3  1  9  1  4

In [56]:
df1.apply(lambda x : x*10)

    a   b   c   d   e
0  20  40  50  80  10
1  80  10  90  80  10
2  20  30  60  50  40
3  20  60  30  70  30
4  30  10  90  10  40

In [57]:
df1['e'].apply(np.square)

0     1
1     1
2    16
3     9
4    16
Name: e, dtype: int32

###  <span style='color:#E70488 '> [ </span> groupby() <span style='color:#E70488 '> ] </span>

In [58]:
movies_df = pd.read_csv('dataset/movies_data.csv')
movies_df.head(2)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"

In [59]:
movies_df.groupby('genre').get_group('Action')

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
19,8.7,Star Wars,PG,Action,121,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
20,8.7,The Matrix,R,Action,136,"[u'Keanu Reeves', u'Laurence Fishburne', u'Car..."
...,...,...,...,...,...,...
918,7.5,Running Scared,R,Action,122,"[u'Paul Walker', u'Cameron Bright', u'Chazz Pa..."
954,7.4,X-Men,PG-13,Action,104,"[u'Patrick Stewart', u'Hugh Jackman', u'Ian Mc..."
963,7.4,La Femme Nikita,R,Action,118,"[u'Anne Parillaud', u'Marc Duret', u'Patrick F..."
967,7.4,The Rock,R,Action,136,"[u'Sean Connery', u'Nicolas Cage', u'Ed Harris']"
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."

In [60]:
movies_df.groupby(['content_rating','genre']).get_group(('PG-13','Action'))

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
43,8.5,The Dark Knight Rises,PG-13,Action,165,"[u'Christian Bale', u'Tom Hardy', u'Anne Hatha..."
113,8.3,Batman Begins,PG-13,Action,140,"[u'Christian Bale', u'Michael Caine', u'Ken Wa..."
118,8.3,Indiana Jones and the Last Crusade,PG-13,Action,127,"[u'Harrison Ford', u'Sean Connery', u'Alison D..."
177,8.2,The Avengers,PG-13,Action,143,"[u'Robert Downey Jr.', u'Chris Evans', u'Scarl..."
196,8.1,Guardians of the Galaxy,PG-13,Action,121,"[u'Chris Pratt', u'Vin Diesel', u'Bradley Coop..."
240,8.1,The Bourne Ultimatum,PG-13,Action,115,"[u'Matt Damon', u'\xc9dgar Ram\xedrez', u'Joan..."
248,8.1,X-Men: Days of Future Past,PG-13,Action,131,"[u'Patrick Stewart', u'Ian McKellen', u'Hugh J..."
301,8.0,Furious 7,PG-13,Action,137,"[u'Vin Diesel', u'Paul Walker', u'Dwayne Johns..."
312,8.0,Star Trek,PG-13,Action,127,"[u'Chris Pine', u'Zachary Quinto', u'Simon Pegg']"
366,8.0,Serenity,PG-13,Action,119,"[u'Nathan Fillion', u'Gina Torres', u'Chiwetel..."
380,8.0,Casino Royale,PG-13,Action,144,"[u'Daniel Craig', u'Eva Green', u'Judi Dench']"
385,8.0,Spartacus,PG-13,Action,197,"[u'Kirk Douglas', u'Laurence Olivier', u'Jean ..."
391,8.0,Edge of Tomorrow,PG-13,Action,113,"[u'Tom Cruise', u'Emily Blunt', u'Bill Paxton']"
403,7.9,Ying xiong,PG-13,Action,99,"[u'Jet Li', u'Tony Chiu Wai Leung', u'Maggie C..."
411,7.9,The Bourne Identity,PG-13,Action,119,"[u'Franka Potente', u'Matt Damon', u'Chris Coo..."
433,7.9,Avatar,PG-13,Action,162,"[u'Sam Worthington', u'Zoe Saldana', u'Sigourn..."
434,7.9,Iron Man,PG-13,Action,126,"[u'Robert Downey Jr.', u'Gwyneth Paltrow', u'T..."
437,7.9,"Crouching Tiger, Hidden Dragon",PG-13,Action,120,"[u'Yun-Fat Chow', u'Michelle Yeoh', u'Ziyi Zha..."
455,7.9,Taken,PG-13,Action,93,"[u'Liam Neeson', u'Maggie Grace', u'Famke Jans..."
488,7.8,Star Trek Into Darkness,PG-13,Action,132,"[u'Chris Pine', u'Zachary Quinto', u'Zoe Salda..."
517,7.8,Captain America: The Winter Soldier,PG-13,Action,136,"[u'Chris Evans', u'Samuel L. Jackson', u'Scarl..."
532,7.8,X-Men: First Class,PG-13,Action,132,"[u'James McAvoy', u'Michael Fassbender', u'Jen..."
539,7.8,The Fugitive,PG-13,Action,130,"[u'Harrison Ford', u'Tommy Lee Jones', u'Sela ..."
567,7.8,The Bourne Supremacy,PG-13,Action,108,"[u'Matt Damon', u'Franka Potente', u'Joan Allen']"
568,7.8,Skyfall,PG-13,Action,143,"[u'Daniel Craig', u'Javier Bardem', u'Naomie H..."
591,7.7,The Count of Monte Cristo,PG-13,Action,131,"[u'Jim Caviezel', u'Guy Pearce', u'Richard Har..."
623,7.7,Dawn of the Planet of the Apes,PG-13,Action,130,"[u'Gary Oldman', u'Keri Russell', u'Andy Serkis']"
653,7.7,Fearless,PG-13,Action,104,"[u'Jet Li', u'Li Sun', u'Yong Dong']"
661,7.7,Star Wars: Episode III - Revenge of the Sith,PG-13,Action,140,"[u'Hayden Christensen', u'Natalie Portman', u'..."
684,7.7,The Big Blue,PG-13,Action,168,"[u'Jean-Marc Barr', u'Jean Reno', u'Rosanna Ar..."
686,7.7,Minority Report,PG-13,Action,145,"[u'Tom Cruise', u'Colin Farrell', u'Samantha M..."
699,7.6,The Fifth Element,PG-13,Action,126,"[u'Bruce Willis', u'Milla Jovovich', u'Gary Ol..."
726,7.6,Sherlock Holmes,PG-13,Action,128,"[u'Robert Downey Jr.', u'Jude Law', u'Rachel M..."
787,7.6,Rise of the Planet of the Apes,PG-13,Action,105,"[u'James Franco', u'Andy Serkis', u'Freida Pin..."
801,7.6,Batman,PG-13,Action,126,"[u'Michael Keaton', u'Jack Nicholson', u'Kim B..."
809,7.6,House of Flying Daggers,PG-13,Action,119,"[u'Ziyi Zhang', u'Takeshi Kaneshiro', u'Andy L..."
812,7.6,Star Trek: First Contact,PG-13,Action,111,"[u'Patrick Stewart', u'Jonathan Frakes', u'Bre..."
856,7.5,Scott Pilgrim vs. the World,PG-13,Action,112,"[u'Michael Cera', u'Mary Elizabeth Winstead', ..."
858,7.5,Sherlock Holmes: A Game of Shadows,PG-13,Action,129,"[u'Robert Downey Jr.', u'Jude Law', u'Jared Ha..."
871,7.5,X2,PG-13,Action,134,"[u'Patrick Stewart', u'Hugh Jackman', u'Halle ..."
954,7.4,X-Men,PG-13,Action,104,"[u'Patrick Stewart', u'Hugh Jackman', u'Ian Mc..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."

In [61]:
movies_df.groupby(['content_rating','genre']).get_group(('PG-13','Action')).sort_values('duration')

,star_rating,title,content_rating,genre,duration,actors_list
455,7.9,Taken,PG-13,Action,93,"[u'Liam Neeson', u'Maggie Grace', u'Famke Jans..."
403,7.9,Ying xiong,PG-13,Action,99,"[u'Jet Li', u'Tony Chiu Wai Leung', u'Maggie C..."
954,7.4,X-Men,PG-13,Action,104,"[u'Patrick Stewart', u'Hugh Jackman', u'Ian Mc..."
653,7.7,Fearless,PG-13,Action,104,"[u'Jet Li', u'Li Sun', u'Yong Dong']"
787,7.6,Rise of the Planet of the Apes,PG-13,Action,105,"[u'James Franco', u'Andy Serkis', u'Freida Pin..."
567,7.8,The Bourne Supremacy,PG-13,Action,108,"[u'Matt Damon', u'Franka Potente', u'Joan Allen']"
812,7.6,Star Trek: First Contact,PG-13,Action,111,"[u'Patrick Stewart', u'Jonathan Frakes', u'Bre..."
856,7.5,Scott Pilgrim vs. the World,PG-13,Action,112,"[u'Michael Cera', u'Mary Elizabeth Winstead', ..."
391,8.0,Edge of Tomorrow,PG-13,Action,113,"[u'Tom Cruise', u'Emily Blunt', u'Bill Paxton']"
240,8.1,The Bourne Ultimatum,PG-13,Action,115,"[u'Matt Damon', u'\xc9dgar Ram\xedrez', u'Joan..."
366,8.0,Serenity,PG-13,Action,119,"[u'Nathan Fillion', u'Gina Torres', u'Chiwetel..."
809,7.6,House of Flying Daggers,PG-13,Action,119,"[u'Ziyi Zhang', u'Takeshi Kaneshiro', u'Andy L..."
411,7.9,The Bourne Identity,PG-13,Action,119,"[u'Franka Potente', u'Matt Damon', u'Chris Coo..."
437,7.9,"Crouching Tiger, Hidden Dragon",PG-13,Action,120,"[u'Yun-Fat Chow', u'Michelle Yeoh', u'Ziyi Zha..."
196,8.1,Guardians of the Galaxy,PG-13,Action,121,"[u'Chris Pratt', u'Vin Diesel', u'Bradley Coop..."
434,7.9,Iron Man,PG-13,Action,126,"[u'Robert Downey Jr.', u'Gwyneth Paltrow', u'T..."
699,7.6,The Fifth Element,PG-13,Action,126,"[u'Bruce Willis', u'Milla Jovovich', u'Gary Ol..."
801,7.6,Batman,PG-13,Action,126,"[u'Michael Keaton', u'Jack Nicholson', u'Kim B..."
312,8.0,Star Trek,PG-13,Action,127,"[u'Chris Pine', u'Zachary Quinto', u'Simon Pegg']"
118,8.3,Indiana Jones and the Last Crusade,PG-13,Action,127,"[u'Harrison Ford', u'Sean Connery', u'Alison D..."
726,7.6,Sherlock Holmes,PG-13,Action,128,"[u'Robert Downey Jr.', u'Jude Law', u'Rachel M..."
858,7.5,Sherlock Holmes: A Game of Shadows,PG-13,Action,129,"[u'Robert Downey Jr.', u'Jude Law', u'Jared Ha..."
539,7.8,The Fugitive,PG-13,Action,130,"[u'Harrison Ford', u'Tommy Lee Jones', u'Sela ..."
623,7.7,Dawn of the Planet of the Apes,PG-13,Action,130,"[u'Gary Oldman', u'Keri Russell', u'Andy Serkis']"
248,8.1,X-Men: Days of Future Past,PG-13,Action,131,"[u'Patrick Stewart', u'Ian McKellen', u'Hugh J..."
591,7.7,The Count of Monte Cristo,PG-13,Action,131,"[u'Jim Caviezel', u'Guy Pearce', u'Richard Har..."
532,7.8,X-Men: First Class,PG-13,Action,132,"[u'James McAvoy', u'Michael Fassbender', u'Jen..."
488,7.8,Star Trek Into Darkness,PG-13,Action,132,"[u'Chris Pine', u'Zachary Quinto', u'Zoe Salda..."
871,7.5,X2,PG-13,Action,134,"[u'Patrick Stewart', u'Hugh Jackman', u'Halle ..."
517,7.8,Captain America: The Winter Soldier,PG-13,Action,136,"[u'Chris Evans', u'Samuel L. Jackson', u'Scarl..."
301,8.0,Furious 7,PG-13,Action,137,"[u'Vin Diesel', u'Paul Walker', u'Dwayne Johns..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
661,7.7,Star Wars: Episode III - Revenge of the Sith,PG-13,Action,140,"[u'Hayden Christensen', u'Natalie Portman', u'..."
113,8.3,Batman Begins,PG-13,Action,140,"[u'Christian Bale', u'Michael Caine', u'Ken Wa..."
568,7.8,Skyfall,PG-13,Action,143,"[u'Daniel Craig', u'Javier Bardem', u'Naomie H..."
177,8.2,The Avengers,PG-13,Action,143,"[u'Robert Downey Jr.', u'Chris Evans', u'Scarl..."
380,8.0,Casino Royale,PG-13,Action,144,"[u'Daniel Craig', u'Eva Green', u'Judi Dench']"
686,7.7,Minority Report,PG-13,Action,145,"[u'Tom Cruise', u'Colin Farrell', u'Samantha M..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
433,7.9,Avatar,PG-13,Action,162,"[u'Sam Worthington', u'Zoe Saldana', u'Sigourn..."
43,8.5,The Dark Knight Rises,PG-13,Action,165,"[u'Christian Bale', u'Tom Hardy', u'Anne Hatha..."
684,7.7,The Big Blue,PG-13,Action,168,"[u'Jean-Marc Barr', u'Jean Reno', u'Rosanna Ar..."
385,8.0,Spartacus,PG-13,Action,197,"[u'Kirk Douglas', u'Laurence Olivier', u'Jean ..."

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">
 used to get the first row of each group after performing a groupby operation on a DataFrame.  </div>

In [62]:
movies_df.groupby('genre').first()

,star_rating,title,content_rating,duration,actors_list
genre,,,,,
Action,9.0,The Dark Knight,PG-13,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
Adventure,8.9,The Lord of the Rings: The Return of the King,PG-13,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."
Animation,8.6,Spirited Away,PG,125,"[u'Daveigh Chase', u'Suzanne Pleshette', u'Miy..."
Biography,8.9,Schindler's List,R,195,"[u'Liam Neeson', u'Ralph Fiennes', u'Ben Kings..."
Comedy,8.6,Life Is Beautiful,PG-13,116,"[u'Roberto Benigni', u'Nicoletta Braschi', u'G..."
Crime,9.3,The Shawshank Redemption,R,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
Drama,8.9,12 Angry Men,NOT RATED,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
Family,7.9,E.T. the Extra-Terrestrial,PG,115,"[u'Henry Thomas', u'Drew Barrymore', u'Peter C..."
Fantasy,7.7,The City of Lost Children,R,112,"[u'Ron Perlman', u'Daniel Emilfork', u'Judith ..."
Film-Noir,8.3,The Third Man,NOT RATED,93,"[u'Orson Welles', u'Joseph Cotten', u'Alida Va..."
History,8.0,Battleship Potemkin,UNRATED,66,"[u'Aleksandr Antonov', u'Vladimir Barsky', u'G..."
Horror,8.6,Psycho,R,109,"[u'Anthony Perkins', u'Janet Leigh', u'Vera Mi..."
Mystery,8.6,Rear Window,APPROVED,112,"[u'James Stewart', u'Grace Kelly', u'Wendell C..."
Sci-Fi,8.2,Blade Runner,R,117,"[u'Harrison Ford', u'Rutger Hauer', u'Sean You..."
Thriller,8.0,Shadow of a Doubt,APPROVED,108,"[u'Teresa Wright', u'Joseph Cotten', u'Macdona..."
Western,8.9,"The Good, the Bad and the Ugly",NOT RATED,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."

# <span style='color:#150458 '> Access Data from Dataframe : </span>

###  <span style='color:#E70488 '> [ </span> Access columns <span style='color:#E70488 '> ] </span>

In [63]:
df_emp['Salary']

0     168251
1      51063
2      50155
3     180294
4     117642
       ...
95    129774
96    156194
97     95673
98     51015
99     93650
Name: Salary, Length: 100, dtype: int64

In [64]:
df_emp[['Emp ID', 'First Name', 'Age in Yrs']]

    Emp ID First Name  Age in Yrs
0   677509       Lois       36.36
1   940761     Brenda       47.02
2   428945        Joe       54.15
3   408351      Diane       39.67
4   193819   Benjamin       40.31
..     ...        ...         ...
95  639892       Jose       22.82
96  704709     Harold       32.61
97  461593     Nicole       52.66
98  392491    Theresa       29.60
99  495141      Tammy       38.38

[100 rows x 3 columns]

###  <span style='color:#E70488 '> [ </span> Access rows <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> First N rows : </span>

In [65]:
df_emp.head() #5rows

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont

In [66]:
df_emp.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
5,499687,Patrick,34.86,58,12.02,72305,Macksburg
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
7,380086,Carol,59.12,40,34.52,60918,Blanchester
8,477616,Frances,58.18,42,23.27,121587,Delmita
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs

####  <span style='color:#E70488 '> Last N rows : </span>

In [67]:
df_emp.tail() #5rows

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [68]:
df_emp.tail(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
90,185032,Eugene,37.84,59,2.64,122950,Racine
91,867084,Deborah,39.77,54,15.41,52767,Atqasuk
92,969964,Janice,37.57,56,0.93,147641,Whiteman Air Force Base
93,158666,Rebecca,56.00,55,34.32,160043,Independence
94,489424,Phillip,39.43,82,1.56,181774,Mapleton
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

###  <span style='color:#E70488 '> [ </span> Access rows & Columns <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1.Slicing Method : </span>

In [69]:
df_emp[4:8]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
5,499687,Patrick,34.86,58,12.02,72305,Macksburg
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
7,380086,Carol,59.12,40,34.52,60918,Blanchester

####  <span style='color:#E70488 '> 2.iloc Method : </span>

In [70]:
df_emp.iloc[:,:]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [71]:
df_emp.iloc[3:9,1:3]

  First Name  Age in Yrs
3      Diane       39.67
4   Benjamin       40.31
5    Patrick       34.86
6      Nancy       22.14
7      Carol       59.12
8    Frances       58.18

In [72]:
df_emp.iloc[[1,4],[3,6]]

   Weight in Kgs       City
1             60  Stonewall
4             58    Fremont

####  <span style='color:#E70488 '> 3.loc Method : </span>

In [73]:
df_emp.loc[:,:]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [74]:
df_emp.loc[2:5,'City']

2    Michigantown
3        Hydetown
4         Fremont
5       Macksburg
Name: City, dtype: object

In [75]:
df_emp.loc[2:5,'Weight in Kgs':'Salary']

   Weight in Kgs  Age in Company  Salary
2             68            0.98   50155
3             51           18.30  180294
4             58            4.01  117642
5             58           12.02   72305

In [76]:
df_emp.loc[[4,7,99],['Weight in Kgs','Salary','City']]

    Weight in Kgs  Salary         City
4              58  117642      Fremont
7              40   60918  Blanchester
99             55   93650         Alma

In [77]:
df_tes = pd.DataFrame(np.random.randint(20,30,size=(7,4)), index=list('abcdefg'),columns=list('KWSD'))
df_tes

    K   W   S   D
a  21  24  27  24
b  20  23  23  26
c  25  26  27  22
d  25  27  27  24
e  27  24  20  28
f  20  25  24  28
g  20  22  21  28

In [78]:
df_tes.loc['c':'f','W':'D']

    W   S   D
c  26  27  22
d  27  27  24
e  24  20  28
f  25  24  28

# <span style='color:#150458 '> Sort Dataframe : </span>

In [79]:
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

## 1 <span style='color:#E70488 '> | </span> Sort Index

In [80]:
df_emp.sort_index(axis=0)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60,13.68,168251,Denver
1,940761,Brenda,47.02,60,9.01,51063,Stonewall
2,428945,Joe,54.15,68,0.98,50155,Michigantown
3,408351,Diane,39.67,51,18.30,180294,Hydetown
4,193819,Benjamin,40.31,58,4.01,117642,Fremont
...,...,...,...,...,...,...,...
95,639892,Jose,22.82,89,1.05,129774,Biloxi
96,704709,Harold,32.61,77,5.93,156194,Carol Stream
97,461593,Nicole,52.66,60,28.53,95673,Detroit
98,392491,Theresa,29.60,57,6.99,51015,Mc Grath
99,495141,Tammy,38.38,55,2.26,93650,Alma

In [81]:
df_emp.sort_index(axis=1)

,Age in Company,Age in Yrs,City,Emp ID,First Name,Salary,Weight in Kgs
0,13.68,36.36,Denver,677509,Lois,168251,60
1,9.01,47.02,Stonewall,940761,Brenda,51063,60
2,0.98,54.15,Michigantown,428945,Joe,50155,68
3,18.30,39.67,Hydetown,408351,Diane,180294,51
4,4.01,40.31,Fremont,193819,Benjamin,117642,58
...,...,...,...,...,...,...,...
95,1.05,22.82,Biloxi,639892,Jose,129774,89
96,5.93,32.61,Carol Stream,704709,Harold,156194,77
97,28.53,52.66,Detroit,461593,Nicole,95673,60
98,6.99,29.60,Mc Grath,392491,Theresa,51015,57
99,2.26,38.38,Alma,495141,Tammy,93650,55

## 2 <span style='color:#E70488 '> | </span> Sort Values

In [82]:
df_emp.sort_values('Salary')

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
24,560455,Carolyn,59.42,53,16.08,42005,Saint Cloud
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs
72,951225,Margaret,25.10,56,0.92,43867,Haswell
60,687017,Frances,56.53,42,6.94,46945,Trego
79,325319,Carolyn,41.19,60,2.73,48736,Wheaton
...,...,...,...,...,...,...,...
71,478003,Cynthia,54.16,60,13.41,186200,Kansas City
42,265813,Jack,32.58,50,10.01,186280,Kalvesta
55,253573,Sharon,26.25,43,3.39,190139,Bartley
65,917395,Christopher,57.37,62,19.73,190765,Willow Beach
17,214352,Theresa,24.66,59,2.52,197537,Toeterville

In [83]:
df_emp.sort_values('Salary').iloc[0:5,:]

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
24,560455,Carolyn,59.42,53,16.08,42005,Saint Cloud
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs
72,951225,Margaret,25.10,56,0.92,43867,Haswell
60,687017,Frances,56.53,42,6.94,46945,Trego
79,325319,Carolyn,41.19,60,2.73,48736,Wheaton

In [84]:
df_emp.sort_values('First Name')

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
36,218791,Aaron,48.49,56,20.08,54402,Eckerty
43,247137,Alan,38.65,80,11.15,154810,Knoxville
41,227922,Amanda,35.02,40,10.28,114257,Lake Charles
31,893212,Amy,36.14,52,14.17,112715,Kline
66,183071,Andrea,32.08,52,7.28,54179,Granger
...,...,...,...,...,...,...,...
17,214352,Theresa,24.66,59,2.52,197537,Toeterville
19,622406,Thomas,49.85,73,19.15,73862,Dutchtown
64,917937,Todd,25.93,74,1.22,163560,Randallstown
13,301576,Wayne,21.10,87,0.02,92758,Maida
78,806955,William,50.05,50,17.36,73734,Mary Esther

In [85]:
df_emp.sort_values(['Salary','First Name'])

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
24,560455,Carolyn,59.42,53,16.08,42005,Saint Cloud
9,162402,Diana,29.73,60,3.44,43010,Eureka Springs
72,951225,Margaret,25.10,56,0.92,43867,Haswell
60,687017,Frances,56.53,42,6.94,46945,Trego
79,325319,Carolyn,41.19,60,2.73,48736,Wheaton
...,...,...,...,...,...,...,...
71,478003,Cynthia,54.16,60,13.41,186200,Kansas City
42,265813,Jack,32.58,50,10.01,186280,Kalvesta
55,253573,Sharon,26.25,43,3.39,190139,Bartley
65,917395,Christopher,57.37,62,19.73,190765,Willow Beach
17,214352,Theresa,24.66,59,2.52,197537,Toeterville

In [86]:
df_emp.sort_values('City', ascending=False, inplace=True)

## 3 <span style='color:#E70488 '> | </span> Reset Index

In [87]:
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
38,726264,Carl,43.63,90,10.14,162159,Wright
23,388642,Ruby,37.27,59,3.91,160623,Woodbury
65,917395,Christopher,57.37,62,19.73,190765,Willow Beach
85,476433,Lillian,42.79,55,17.65,149878,Wichita
92,969964,Janice,37.57,56,0.93,147641,Whiteman Air Force Base
...,...,...,...,...,...,...,...
6,539712,Nancy,22.14,50,0.87,98189,Atlanta
56,904898,Ann,24.61,44,0.45,182521,Arlee
99,495141,Tammy,38.38,55,2.26,93650,Alma
67,316110,Jeremy,52.51,52,11.33,178847,Alcoa
75,765850,Linda,25.96,40,0.20,113256,Albion

In [88]:
df_emp.reset_index(drop=True,inplace=True)

In [89]:
df_emp

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,726264,Carl,43.63,90,10.14,162159,Wright
1,388642,Ruby,37.27,59,3.91,160623,Woodbury
2,917395,Christopher,57.37,62,19.73,190765,Willow Beach
3,476433,Lillian,42.79,55,17.65,149878,Wichita
4,969964,Janice,37.57,56,0.93,147641,Whiteman Air Force Base
...,...,...,...,...,...,...,...
95,539712,Nancy,22.14,50,0.87,98189,Atlanta
96,904898,Ann,24.61,44,0.45,182521,Arlee
97,495141,Tammy,38.38,55,2.26,93650,Alma
98,316110,Jeremy,52.51,52,11.33,178847,Alcoa
99,765850,Linda,25.96,40,0.20,113256,Albion

## 4 <span style='color:#E70488 '> | </span> Set Index

In [90]:
df_heart

     age  sex  target
0     63    1       1
1     37    1       1
2     41    0       1
3     56    1       1
4     57    0       1
..   ...  ...     ...
298   57    0       0
299   45    1       0
300   68    1       0
301   57    1       0
302   57    0       0

[303 rows x 3 columns]

In [91]:
df_heart.set_index('age')

     sex  target
age
63     1       1
37     1       1
41     0       1
56     1       1
57     0       1
..   ...     ...
57     0       0
45     1       0
68     1       0
57     1       0
57     0       0

[303 rows x 2 columns]

In [92]:
df_heart.set_index('age',inplace=True)

In [93]:
df_heart

     sex  target
age
63     1       1
37     1       1
41     0       1
56     1       1
57     0       1
..   ...     ...
57     0       0
45     1       0
68     1       0
57     1       0
57     0       0

[303 rows x 2 columns]

In [94]:
df_heart.reset_index(drop=False,inplace=True)

In [95]:
df_heart

     age  sex  target
0     63    1       1
1     37    1       1
2     41    0       1
3     56    1       1
4     57    0       1
..   ...  ...     ...
298   57    0       0
299   45    1       0
300   68    1       0
301   57    1       0
302   57    0       0

[303 rows x 3 columns]

# <span style='color:#150458 '> Handling Missing Values : </span>

In [96]:
df_emp.iloc[4:9,2:6] = np.nan
df_emp.iloc[45:73,[1,6]] = np.nan
df = df_emp.copy()

## 1 <span style='color:#E70488 '> | </span> Detecting Missing Values

###  <span style='color:#E70488 '> [ </span> df.isna() <span style='color:#E70488 '> ] </span>

In [97]:
df.isna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,True,True,True,True,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [98]:
df.isna().sum()

Emp ID             0
First Name        28
Age in Yrs         5
Weight in Kgs      5
Age in Company     5
Salary             5
City              28
dtype: int64

###  <span style='color:#E70488 '> [ </span> df.isnull() <span style='color:#E70488 '> ] </span>

In [99]:
df.isnull()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,True,True,True,True,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [100]:
df.isnull().sum()

Emp ID             0
First Name        28
Age in Yrs         5
Weight in Kgs      5
Age in Company     5
Salary             5
City              28
dtype: int64

In [101]:
df.isnull().mean()

Emp ID            0.00
First Name        0.28
Age in Yrs        0.05
Weight in Kgs     0.05
Age in Company    0.05
Salary            0.05
City              0.28
dtype: float64

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Emp ID          100 non-null    int64
 1   First Name      72 non-null     object
 2   Age in Yrs      95 non-null     float64
 3   Weight in Kgs   95 non-null     float64
 4   Age in Company  95 non-null     float64
 5   Salary          95 non-null     float64
 6   City            72 non-null     object
dtypes: float64(4), int64(1), object(2)
memory usage: 5.6+ KB

## 2 <span style='color:#E70488 '> | </span> Fill Missing Values

###  <span style='color:#E70488 '> [ </span> df.fillna() <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1.using mean : </span>

In [103]:
df['Age in Yrs'].mean()

38.99442105263158

In [104]:
df['Age in Yrs'].fillna(df['Age in Yrs'].mean(),inplace=True)

In [105]:
df['Age in Yrs'].isnull().sum()

0

####  <span style='color:#E70488 '> 2.using median : </span>

In [106]:
df['Weight in Kgs'].fillna(df['Weight in Kgs'].median(),inplace=True)

In [107]:
df['Weight in Kgs'].isnull().sum()

0


####  <span style='color:#E70488 '> 3.using mode : </span>

In [108]:
df['City'].mode()[0]

'Albion'

In [109]:
df['City'].fillna(df['City'].mode()[0],inplace=True)

In [110]:
df['City'].isnull().sum()

0

####  <span style='color:#E70488 '> 4.using min : </span>

In [111]:
df['Salary'].fillna(df['Salary'].min(),inplace=True)

In [112]:
df['Salary'].isnull().sum()

0

####  <span style='color:#E70488 '> 5.using max : </span>

In [113]:
df['Age in Company'].fillna(df['Age in Company'].max(),inplace=True)

In [114]:
df['Age in Company'].isnull().sum()

0

####  <span style='color:#E70488 '> 6.using static : </span>

In [115]:
df['First Name'].fillna('Max',inplace=True)

In [116]:
df['First Name'].isnull().sum()

0

## 3 <span style='color:#E70488 '> | </span> Drop Missing Values

In [117]:
df_emp.isnull().sum()

Emp ID             0
First Name        28
Age in Yrs         5
Weight in Kgs      5
Age in Company     5
Salary             5
City              28
dtype: int64

###  <span style='color:#E70488 '> [ </span> df.dropna() <span style='color:#E70488 '> ] </span>

####  <span style='color:#E70488 '> 1.drop rows : </span>

In [118]:
df_emp.dropna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,726264,Carl,43.63,90.0,10.14,162159.0,Wright
1,388642,Ruby,37.27,59.0,3.91,160623.0,Woodbury
2,917395,Christopher,57.37,62.0,19.73,190765.0,Willow Beach
3,476433,Lillian,42.79,55.0,17.65,149878.0,Wichita
9,214352,Theresa,24.66,59.0,2.52,197537.0,Toeterville
...,...,...,...,...,...,...,...
95,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
96,904898,Ann,24.61,44.0,0.45,182521.0,Arlee
97,495141,Tammy,38.38,55.0,2.26,93650.0,Alma
98,316110,Jeremy,52.51,52.0,11.33,178847.0,Alcoa
99,765850,Linda,25.96,40.0,0.20,113256.0,Albion

In [119]:
dd = df_emp.dropna(thresh=3)
dd.isnull().sum()

Emp ID             0
First Name        28
Age in Yrs         5
Weight in Kgs      5
Age in Company     5
Salary             5
City              28
dtype: int64

In [120]:
dd.shape

(100, 7)

####  <span style='color:#E70488 '> 2.drop columns : </span>

In [121]:
df_emp.dropna(axis=1)

    Emp ID
0   726264
1   388642
2   917395
3   476433
4   969964
..     ...
95  539712
96  904898
97  495141
98  316110
99  765850

[100 rows x 1 columns]

In [122]:
df_emp.dropna(axis=1,thresh=95)

    Emp ID  Age in Yrs  Weight in Kgs  Age in Company    Salary
0   726264       43.63           90.0           10.14  162159.0
1   388642       37.27           59.0            3.91  160623.0
2   917395       57.37           62.0           19.73  190765.0
3   476433       42.79           55.0           17.65  149878.0
4   969964         NaN            NaN             NaN       NaN
..     ...         ...            ...             ...       ...
95  539712       22.14           50.0            0.87   98189.0
96  904898       24.61           44.0            0.45  182521.0
97  495141       38.38           55.0            2.26   93650.0
98  316110       52.51           52.0           11.33  178847.0
99  765850       25.96           40.0            0.20  113256.0

[100 rows x 5 columns]

## 4 <span style='color:#E70488 '> | </span> Detecting Non Missing Values

###  <span style='color:#E70488 '> [ </span> df.notna() <span style='color:#E70488 '> ] </span>

In [123]:
df_emp.notna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True
4,True,True,False,False,False,False,True
...,...,...,...,...,...,...,...
95,True,True,True,True,True,True,True
96,True,True,True,True,True,True,True
97,True,True,True,True,True,True,True
98,True,True,True,True,True,True,True
99,True,True,True,True,True,True,True

In [124]:
df_emp.notna().sum()

Emp ID            100
First Name         72
Age in Yrs         95
Weight in Kgs      95
Age in Company     95
Salary             95
City               72
dtype: int64

###  <span style='color:#E70488 '> [ </span> df.notnull() <span style='color:#E70488 '> ] </span>

In [125]:
df_emp.notnull()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True
4,True,True,False,False,False,False,True
...,...,...,...,...,...,...,...
95,True,True,True,True,True,True,True
96,True,True,True,True,True,True,True
97,True,True,True,True,True,True,True
98,True,True,True,True,True,True,True
99,True,True,True,True,True,True,True

In [126]:
df_emp.notnull().sum()

Emp ID            100
First Name         72
Age in Yrs         95
Weight in Kgs      95
Age in Company     95
Salary             95
City               72
dtype: int64

# <span style='color:#150458 '> Pandas Joins : </span>

## 1 <span style='color:#E70488 '> | </span> Append

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">
Function in pandas is used to append rows of one DataFrame to another DataFrame

- Syntax:
    
    1.df1.append(df2)
    
    2.df1.append([df2,df3,df4])
    
    3.df1.append(df_list)
</div>

In [127]:
df1 = pd.DataFrame({'Employee_Name':['Suraj','Radhika','Mona','Ronit'],
                   'Age':[34,46,32,22],
                   'Location':['Pune','Nashik','Mumbai','Raipur']})

df2 = pd.DataFrame({'Employee_Name':['Kedar','Suhon','Neha','Rekha'],
                   'Age':[45,34,21,34],
                   'Location':['Pune','Nashik','Mumbai','Raipur']})

In [128]:
df1.append(df2)

C:\Users\Prerana\AppData\Local\Temp\ipykernel_25864\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

  Employee_Name  Age Location
0         Suraj   34     Pune
1       Radhika   46   Nashik
2          Mona   32   Mumbai
3         Ronit   22   Raipur
0         Kedar   45     Pune
1         Suhon   34   Nashik
2          Neha   21   Mumbai
3         Rekha   34   Raipur

In [129]:
df1.append(df2,ignore_index=True)

C:\Users\Prerana\AppData\Local\Temp\ipykernel_25864\2717680053.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2,ignore_index=True)

  Employee_Name  Age Location
0         Suraj   34     Pune
1       Radhika   46   Nashik
2          Mona   32   Mumbai
3         Ronit   22   Raipur
4         Kedar   45     Pune
5         Suhon   34   Nashik
6          Neha   21   Mumbai
7         Rekha   34   Raipur

In [130]:
df1.append(df2,sort=True)

C:\Users\Prerana\AppData\Local\Temp\ipykernel_25864\3708838071.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2,sort=True)

   Age Employee_Name Location
0   34         Suraj     Pune
1   46       Radhika   Nashik
2   32          Mona   Mumbai
3   22         Ronit   Raipur
0   45         Kedar     Pune
1   34         Suhon   Nashik
2   21          Neha   Mumbai
3   34         Rekha   Raipur

In [131]:
new_df = df1.append(df2,ignore_index=True)

C:\Users\Prerana\AppData\Local\Temp\ipykernel_25864\261879306.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df = df1.append(df2,ignore_index=True)

In [132]:
new_df

  Employee_Name  Age Location
0         Suraj   34     Pune
1       Radhika   46   Nashik
2          Mona   32   Mumbai
3         Ronit   22   Raipur
4         Kedar   45     Pune
5         Suhon   34   Nashik
6          Neha   21   Mumbai
7         Rekha   34   Raipur

In [133]:
df3 = pd.DataFrame({'Employee_Name':['Suraj','Sham','Netra','Anu'],
                   'Age':[45,34,21,34],
                   'Location':['Pune','Nashik','Mumbai','Raipur'],
                   'Salary':[140000,23090,456422,67322]})

In [134]:
new_df.append(df3)

C:\Users\Prerana\AppData\Local\Temp\ipykernel_25864\3753469911.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_df.append(df3)

  Employee_Name  Age Location    Salary
0         Suraj   34     Pune       NaN
1       Radhika   46   Nashik       NaN
2          Mona   32   Mumbai       NaN
3         Ronit   22   Raipur       NaN
4         Kedar   45     Pune       NaN
5         Suhon   34   Nashik       NaN
6          Neha   21   Mumbai       NaN
7         Rekha   34   Raipur       NaN
0         Suraj   45     Pune  140000.0
1          Sham   34   Nashik   23090.0
2         Netra   21   Mumbai  456422.0
3           Anu   34   Raipur   67322.0

## 2 <span style='color:#E70488 '> | </span> Concat

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">
function in pandas is used to concatenate pandas objects along a particular axis. It can concatenate Series, DataFrame, or Panel objects. Concatenation is performed row-wise or column-wise, depending on the axis specified.

- Syntax:
    
   pd.concat([df1,df2,df3],axis = 0, ignore_index=True, join = 'outer')
</div>

In [135]:
pd.concat([df1,df3],axis=0)

  Employee_Name  Age Location    Salary
0         Suraj   34     Pune       NaN
1       Radhika   46   Nashik       NaN
2          Mona   32   Mumbai       NaN
3         Ronit   22   Raipur       NaN
0         Suraj   45     Pune  140000.0
1          Sham   34   Nashik   23090.0
2         Netra   21   Mumbai  456422.0
3           Anu   34   Raipur   67322.0

In [136]:
pd.concat([df1,df3],axis=1)

  Employee_Name  Age Location Employee_Name  Age Location  Salary
0         Suraj   34     Pune         Suraj   45     Pune  140000
1       Radhika   46   Nashik          Sham   34   Nashik   23090
2          Mona   32   Mumbai         Netra   21   Mumbai  456422
3         Ronit   22   Raipur           Anu   34   Raipur   67322

In [137]:
pd.concat([df1,df2,df3],axis=0)

  Employee_Name  Age Location    Salary
0         Suraj   34     Pune       NaN
1       Radhika   46   Nashik       NaN
2          Mona   32   Mumbai       NaN
3         Ronit   22   Raipur       NaN
0         Kedar   45     Pune       NaN
1         Suhon   34   Nashik       NaN
2          Neha   21   Mumbai       NaN
3         Rekha   34   Raipur       NaN
0         Suraj   45     Pune  140000.0
1          Sham   34   Nashik   23090.0
2         Netra   21   Mumbai  456422.0
3           Anu   34   Raipur   67322.0

In [138]:
pd.concat([df1,df2,df3],axis=0,join='outer')

  Employee_Name  Age Location    Salary
0         Suraj   34     Pune       NaN
1       Radhika   46   Nashik       NaN
2          Mona   32   Mumbai       NaN
3         Ronit   22   Raipur       NaN
0         Kedar   45     Pune       NaN
1         Suhon   34   Nashik       NaN
2          Neha   21   Mumbai       NaN
3         Rekha   34   Raipur       NaN
0         Suraj   45     Pune  140000.0
1          Sham   34   Nashik   23090.0
2         Netra   21   Mumbai  456422.0
3           Anu   34   Raipur   67322.0

In [139]:
pd.concat([df1,df2,df3],axis=0,join='inner')

  Employee_Name  Age Location
0         Suraj   34     Pune
1       Radhika   46   Nashik
2          Mona   32   Mumbai
3         Ronit   22   Raipur
0         Kedar   45     Pune
1         Suhon   34   Nashik
2          Neha   21   Mumbai
3         Rekha   34   Raipur
0         Suraj   45     Pune
1          Sham   34   Nashik
2         Netra   21   Mumbai
3           Anu   34   Raipur

## 3 <span style='color:#E70488 '> | </span> Merge

<div class="alert alert-block alert-info" style="font-size:14px; font-family:verdana; line-height: 1.7em;">
function in pandas is used to merge DataFrame objects based on one or more keys. It performs database-style join operations by default, and can handle both one-to-one and many-to-one joins.
</div>

In [140]:
df1 = pd.DataFrame({'Employee Name': ['Suraj','Sagar', 'Pravin','Rohit'],
                   'Age':[30,29,25,35],
                   'Location':['Pune','Mumbai', 'Delhi', 'Chennai'],
                   'Salary' : [30000,50000,60000,40000]},index = list('abcd'))

df2 = pd.DataFrame({'Employee Name': ['Akshay','Suresh', 'Pravin','Rohit'],
                   'Age':[25,27,25,35],
                   'Location':['Pune','Mumbai', 'Delhi', 'Chennai'],
                   'Designation' : ['Python Developer', 'Data Scientist', 'JAVA Developer',
                                    'Software Engineer']},
                  index = list('cdxy'))

df1

  Employee Name  Age Location  Salary
a         Suraj   30     Pune   30000
b         Sagar   29   Mumbai   50000
c        Pravin   25    Delhi   60000
d         Rohit   35  Chennai   40000

In [141]:
df2

  Employee Name  Age Location        Designation
c        Akshay   25     Pune   Python Developer
d        Suresh   27   Mumbai     Data Scientist
x        Pravin   25    Delhi     JAVA Developer
y         Rohit   35  Chennai  Software Engineer

In [142]:
pd.merge(df1,df2,how='outer')

  Employee Name  Age Location   Salary        Designation
0         Suraj   30     Pune  30000.0                NaN
1         Sagar   29   Mumbai  50000.0                NaN
2        Pravin   25    Delhi  60000.0     JAVA Developer
3         Rohit   35  Chennai  40000.0  Software Engineer
4        Akshay   25     Pune      NaN   Python Developer
5        Suresh   27   Mumbai      NaN     Data Scientist

In [143]:
pd.merge(df1,df2,how='inner')

  Employee Name  Age Location  Salary        Designation
0        Pravin   25    Delhi   60000     JAVA Developer
1         Rohit   35  Chennai   40000  Software Engineer

In [144]:
pd.merge(df1,df2,how='left')

  Employee Name  Age Location  Salary        Designation
0         Suraj   30     Pune   30000                NaN
1         Sagar   29   Mumbai   50000                NaN
2        Pravin   25    Delhi   60000     JAVA Developer
3         Rohit   35  Chennai   40000  Software Engineer

In [145]:
pd.merge(df1,df2,how='right')

  Employee Name  Age Location   Salary        Designation
0        Akshay   25     Pune      NaN   Python Developer
1        Suresh   27   Mumbai      NaN     Data Scientist
2        Pravin   25    Delhi  60000.0     JAVA Developer
3         Rohit   35  Chennai  40000.0  Software Engineer

In [146]:
pd.merge(df1,df2,on='Employee Name',how='outer')

,Employee Name,Age_x,Location_x,Salary,Age_y,Location_y,Designation
0,Suraj,30.0,Pune,30000.0,NaN,NaN,NaN
1,Sagar,29.0,Mumbai,50000.0,NaN,NaN,NaN
2,Pravin,25.0,Delhi,60000.0,25.0,Delhi,JAVA Developer
3,Rohit,35.0,Chennai,40000.0,35.0,Chennai,Software Engineer
4,Akshay,NaN,NaN,NaN,25.0,Pune,Python Developer
5,Suresh,NaN,NaN,NaN,27.0,Mumbai,Data Scientist

## 4 <span style='color:#E70488 '> | </span> Join

In [147]:
df1 = pd.DataFrame({"A":[10,20,30],
                   "B":[100,400, 900]}, index = list('abc'))

df2 = pd.DataFrame({"C":[40,50,60],
                   "D":[1000,4000, 9000]}, index = list('acd'))
df1

    A    B
a  10  100
b  20  400
c  30  900

In [148]:
df2

    C     D
a  40  1000
c  50  4000
d  60  9000

In [149]:
df1.join(df2,how='left')

    A    B     C       D
a  10  100  40.0  1000.0
b  20  400   NaN     NaN
c  30  900  50.0  4000.0

In [150]:
df1.join(df2,how='outer')

      A      B     C       D
a  10.0  100.0  40.0  1000.0
b  20.0  400.0   NaN     NaN
c  30.0  900.0  50.0  4000.0
d   NaN    NaN  60.0  9000.0

In [151]:
df1.join(df2,how='inner')

    A    B   C     D
a  10  100  40  1000
c  30  900  50  4000

In [152]:
df1.join(df2,how='right')

      A      B   C     D
a  10.0  100.0  40  1000
c  30.0  900.0  50  4000
d   NaN    NaN  60  9000

In [153]:
#end